# RebarManyLoopsError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..RebarManyLoopsError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Rebar Sketch contains more than one loop. Can't create Rebar.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarManyLoopsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarManyLoopsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarManyLoopsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace